Revit 2025 API
RailTagentJoinOption Enumeration
 The tangent joins of the rails.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum RailTagentJoinOption
Public Enumeration RailTagentJoinOption
public enum class RailTagentJoinOption
type RailTagentJoinOption
Members
Member name | Value | Description
AddVerticalOrHorizontalSegments | 0 |  Add vertical or horizontal segments.
NoConnector | 1 |  No connector.
ExtendRailsToMeet | 2 |  Extend rails to meet.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace